app/Views/student/studentDashboardView.php

                                                    $row->course_id;
                                                    $builder = $db->table('teacher_course');
                                                    $builder->where('course_id', $row->course_id);
                                                    $query   = $builder->get();
---
SELECT *
FROM `teacher_course`
WHERE `course_id` = '65'