app/Views/teacher/teacherDashboard_menu.php

                        $db = \Config\Database::connect();
                        $builder = $db->table('teacher_profile');
                        $builder->where('teacher_id',  $teacher_id);
                        $query   = $builder->get();
---
SELECT *
FROM `teacher_profile`
WHERE `teacher_id` = 'TEA253620D708'