app/Views/examsystem/questionSetView.php


                  $db = \Config\Database::connect();
                  $builder = $db->table('question_set_setup');
                  $results = $builder->get()->getResult();
---
SELECT *
FROM `question_set_setup`