app/Controllers/CheckoutController.php

    public function checkoutCart()
    {
       // session_start();
       if (isset($_SESSION["cartItems"]))
       {
        // Retrieve cart items from the session
        $cartItems = $_SESSION["cartItems"];
        // Retrieve selected batch IDs from the form
        $selectedBatchIds = $this->request->getPost('batch_ids');  // Array of selected batch IDs
        $weekly_days = isset($_POST['weekly_days']) ? $_POST['weekly_days'] : null;
        $time_slots = isset($_POST['time_slot']) ? $_POST['time_slot'] : null;

        // Update each cart item with the selected batch ID
        foreach ($cartItems as $index => $item) {
            if (isset($selectedBatchIds[$index])) {
                $cartItems[$index]['batch_id'] = $selectedBatchIds[$index];  // Add batch_id to cart item
                $cartItems[$index]['weekly_days'] = htmlspecialchars($weekly_days[$index]);  // Add weekly_days to cart item
                $cartItems[$index]['time_slot'] = htmlspecialchars($time_slots[$index]);  // Add time_slots to cart item

            }
        }

        // Update the session with the modified cart items
        $_SESSION["cartItems"] = $cartItems;

        // Fetch student details from the database
        $student_id = $_SESSION['student_id'];
        $builder = $this->db->table('student_registration');
        $builder->where("student_id", $student_id);
        $query = $builder->get();
---
SELECT *
FROM `student_registration`
WHERE `student_id` = 'STD25344B7F3D'