app/Controllers/QuestionSetController.php

  public function index()
  {
    if (isset($_SESSION['id'])) {
      $teacher_id = $_SESSION['id'];

      $builder = $this->db->table('exam_setup');
      $builder->select('exam_setup.*, teacher_course.course_status, teacher_course.coures_title ');
      $builder->join('teacher_course', 'teacher_course.course_id = exam_setup.exam_subject_course_id', 'left');
      $builder->where('exam_setup.course_teacher_id', $teacher_id);
      $builder->where('teacher_course.course_status', 'approved');

      $query = $builder->get();
---
SELECT `exam_setup`.*, `teacher_course`.`course_status`, `teacher_course`.`coures_title`
FROM `exam_setup`
LEFT JOIN `teacher_course` ON `teacher_course`.`course_id` = `exam_setup`.`exam_subject_course_id`
WHERE `exam_setup`.`course_teacher_id` = 'TEA253620D708'
AND `teacher_course`.`course_status` = 'approved'

  public function question_show_for_set_creation()
  {
    $course_id = $this->request->getVar('course_id');
    $question_set_id = $this->request->getVar('question_set_id');

    //////////////////////////IF Question Set Already Exist then have to update////////////////////////
    $builder = $this->db->table('question_set');
    $builder->where('subject_id', $course_id);
    $builder->where('question_set_id', $question_set_id);
    $query   = $builder->get();
---
SELECT *
FROM `question_set`
WHERE `subject_id` = 'EXAM-2603680136'
AND `question_set_id` IS NULL