app/Controllers/StudentDashboardController.php

    public function index()
    {
        if (!isset($_SESSION['student_id'])) {
            echo "You are not logged in!";
        } else {
            $student_id = $_SESSION['student_id'];
            $sql = "SELECT student_registration.student_name, student_registration.student_email,student_registration.student_id,
                student_profile.stu_pic
                FROM student_registration
                LEFT JOIN student_profile ON student_registration.student_id = student_profile.stu_profile_id
                WHERE student_registration.student_id ='$student_id'";

            $builder = $this->db->table('purchase_course');
            $builder->where("student_or_buyer_id", $student_id);
            $query = $builder->get();
---
SELECT *
FROM `purchase_course`
WHERE `student_or_buyer_id` = 'STD2423157E03'

    public function exam_system_view()
    {
        if (isset($_SESSION['student_id'])) {
            $student_id = $_SESSION['student_id'];

            $query = $this->db->table('purchase_course')
            ->select('purchase_course.course_id, purchase_course.student_or_buyer_id, teacher_course.coures_title')
            ->join('teacher_course', 'purchase_course.course_id = teacher_course.course_id', 'left')
            ->where('purchase_course.student_or_buyer_id', $student_id)
            ->distinct()
            ->get();
---
SELECT DISTINCT `purchase_course`.`course_id`, `purchase_course`.`student_or_buyer_id`, `teacher_course`.`coures_title`
FROM `purchase_course`
LEFT JOIN `teacher_course` ON `purchase_course`.`course_id` = `teacher_course`.`course_id`
WHERE `purchase_course`.`student_or_buyer_id` = 'STD2423157E03'