app/Models/ExamResultModel.php

    public function getExamResults($studentId)
    {
        // Build the query using the Query Builder
        $builder = $this->db->table($this->table . ' esp') // Set the base table 'exam_start_process' with alias 'esp'
            ->distinct() // Apply DISTINCT to the entire query
            ->join('exam_setup es', 'esp.exam_setup_id = es.exam_setup_id', 'right') // Perform the right join
            ->select('es.exam_name, esp.exam_setup_id, esp.student_id') // Specify the fields to retrieve
            ->where('esp.status', '1') // Add the WHERE condition for esp.status = 1
            ->where('esp.student_id', $studentId); // Add the WHERE condition for esp.student_id dynamically

        $query = $builder->get(); // Execute the query
---
SELECT DISTINCT `es`.`exam_name`, `esp`.`exam_setup_id`, `esp`.`student_id`
FROM `exam_start_process` `esp`
RIGHT JOIN `exam_setup` `es` ON `esp`.`exam_setup_id` = `es`.`exam_setup_id`
WHERE `esp`.`status` = '1'
AND `esp`.`student_id` = 'STD2602227A23'